Repository: alexlana/alx-wp-gcp
Catalog: app_data/languages/plugins/auto-upload-images-*.po
Languages: es_es

source: Make a Donation
es_es: Hacer una donación

source: If you want to help to plugin development and if you can do so please make a donation to the project and encourage others to do so, for more updates and more features.
es_es: Si quieres ayudar al desarrollo de este plugin para nuevas actualizaciones y funcionalidades, podrías por favor realizar una donación al proyecto y animar a otros a hacerlo.

source: Support and Donate to the Plugin
es_es: Apoya y dona al plugin

source: Are you sure to reset all options to defaults?
es_es: ¿Estás seguro de que has restablecido todas las opciones a los valores por defecto?

source: Reset Options
es_es: Opciones de restablecimiento

source: To activate this feature please enable Gd or Imagick extensions of PHP.
es_es: Para activar esta característica, activa las extensiones Gd o Imagick de PHP.

source: (Inactive)
es_es: (Inactivo)

source: Successfully settings reset to defaults.
es_es: Se han restablecido correctamente los ajustes a los valores por defecto.

source: Automatically upload and import external images of a post to Wordpress upload directory and media management
es_es: Sube e importa automáticamente las imágenes externas de una entrada al directorio de subida de WordPress y al gestor de medios

source: If you are a wp developer and like to contribute to this plugin development or you are a translator and want to have this plugin in your language you can start from <a href="https://github.com/airani/wp-auto-upload" target="_blank">plugin Github repository</a>.
es_es: Si eres un desarrollador de WordPress y quieres contribuir al desarrollo de este plugin, o eres un traductor y quieres tener este plugin en tu idioma, puedes empezar desde el <a href="https://github.com/airani/wp-auto-upload" target="_blank">repositorio del plugin en GitHub</a>.

source: Official Page
es_es: Página oficial

source: Rate to this plugin
es_es: Valora a este plugin

source: Plugin Page in WP
es_es: Página del plugin en WP

source: Github Repository
es_es: Repositorio en GitHub

source: Report Bug and Issues
es_es: Informar de un error y problemas

source: Information
es_es: Información

source: Enter the domains you wish to be excluded from uploading images: (One domain per line)
es_es: Introduce los nombres de dominio que deseas excluir al subir imágenes: (Un nombre de dominio por línea)

source: Exclude Domains:
es_es: Excluir dominios:

source: Select the Post Types that you want exclude from automatic uploading
es_es: Selecciona los tipos de contenido que quieres excluir de la subida automática

source: Exclude Post Types:
es_es: Excluir los tipos de contenido:

source: You can choose max width and height for images uploaded by this plugin on your site. If you leave empty each one of fields by default use the original size of the image.
es_es: Puedes elegir el ancho y alto máximos para las imágenes subidas por este plugin en tu sitio. Si se deja vacío cada uno de los campos por defecto, se usará el tamaño original de la imagen.

source: Max Height
es_es: Altura máxima

source: Max Width
es_es: Anchura máxima

source: Image Size:
es_es: Tamaño de la imagen:

source: Choose a custom alt name for the new images will be uploaded. You can also use these shortcodes %s.
es_es: Elige un nombre «alt» personalizado para las nuevas imágenes que se subirán. También puedes usar estos shortcodes: %s.

source: Alt Name:
es_es: Nombre alternativo:

source: Choose a custom filename for the new images will be uploaded. You can also use these shortcodes %s.
es_es: Elige un nombre de archivo personalizado para las nuevas imágenes que se subirán. También puedes usar estos shortcodes; %s.

source: Image Name:
es_es: Nombre de la imagen:

source: If you need to choose a new base URL for the images that will be automatically uploaded. Ex:
es_es: Si necesitas escoger una nueva URL base para las imágenes que van a ser subidas automaticamente. Por ej.

source: Base URL:
es_es: URL base:

source: Settings Saved.
es_es: Ajustes guardados.

source: Auto Upload Images Settings
es_es: Ajustes de Auto Upload Images
